; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	image1 - mode
	infrared0 - mode
	image2 - mode
	GroundStation5 - direction
	GroundStation8 - direction
	GroundStation0 - direction
	Star4 - direction
	Star6 - direction
	Star3 - direction
	Star7 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Star15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 image2)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 Star6)
	(supports instrument2 image1)
	(supports instrument2 image2)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet14)
	(supports instrument4 image1)
	(supports instrument4 image2)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 Star7)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star9)
	(supports instrument5 image1)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 Star7)
	(calibration_target instrument5 GroundStation0)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation1)
	(calibration_target instrument6 Star3)
	(calibration_target instrument6 Star6)
	(supports instrument7 infrared0)
	(calibration_target instrument7 GroundStation1)
	(calibration_target instrument7 GroundStation2)
	(calibration_target instrument7 Star7)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon16)
)
(:goal (and
	(pointing satellite1 GroundStation5)
	(pointing satellite3 Phenomenon12)
	(have_image Star9 image1)
	(have_image Planet10 image1)
	(have_image Star11 infrared0)
	(have_image Phenomenon12 image1)
	(have_image Phenomenon13 image2)
	(have_image Planet14 image1)
	(have_image Star15 image1)
	(have_image Phenomenon16 image1)
))

)

; plan
1. (turn_to satellite3 groundstation0 phenomenon16)
   deleted: (pointing satellite3 phenomenon16)
   added: (pointing satellite3 groundstation0)
   goals met: 0 of 10
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 0 of 10
3. (calibrate satellite3 instrument5 groundstation0)
   added: (calibrated instrument5)
   goals met: 0 of 10
4. (turn_to satellite3 planet14 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 planet14)
   goals met: 0 of 10
5. (take_image satellite3 planet14 instrument5 image1)
   added: (have_image planet14 image1)
   goals met: 1 of 10
6. (turn_to satellite3 planet10 planet14)
   deleted: (pointing satellite3 planet14)
   added: (pointing satellite3 planet10)
   goals met: 1 of 10
7. (take_image satellite3 planet10 instrument5 image1)
   added: (have_image planet10 image1)
   goals met: 2 of 10
8. (turn_to satellite3 phenomenon16 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 phenomenon16)
   goals met: 2 of 10
9. (take_image satellite3 phenomenon16 instrument5 image1)
   added: (have_image phenomenon16 image1)
   goals met: 3 of 10
10. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 10
11. (calibrate satellite0 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 3 of 10
12. (turn_to satellite0 phenomenon13 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 10
13. (take_image satellite0 phenomenon13 instrument1 image2)
   added: (have_image phenomenon13 image2)
   goals met: 4 of 10
14. (turn_to satellite1 groundstation5 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 groundstation5)
   goals met: 5 of 10
15. (turn_to satellite3 star11 phenomenon16)
   deleted: (pointing satellite3 phenomenon16)
   added: (pointing satellite3 star11)
   goals met: 5 of 10
16. (take_image satellite3 star11 instrument5 infrared0)
   added: (have_image star11 infrared0)
   goals met: 6 of 10
17. (turn_to satellite3 star15 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 star15)
   goals met: 6 of 10
18. (take_image satellite3 star15 instrument5 image1)
   added: (have_image star15 image1)
   goals met: 7 of 10
19. (turn_to satellite3 star9 star15)
   deleted: (pointing satellite3 star15)
   added: (pointing satellite3 star9)
   goals met: 7 of 10
20. (take_image satellite3 star9 instrument5 image1)
   added: (have_image star9 image1)
   goals met: 8 of 10
21. (turn_to satellite3 phenomenon12 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 phenomenon12)
   goals met: 9 of 10
22. (take_image satellite3 phenomenon12 instrument5 image1)
   added: (have_image phenomenon12 image1)
   goals met: 10 of 10
